import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:jazzpowertoolsapp/app/data/constant/app_color.dart';

import '../../../../data/constant/image_string.dart';

class JokeOftheDay extends StatelessWidget {
   JokeOftheDay({Key? key}) : super(key: key);
  int currentDay = DateTime.now().day;

  // final joke = [
  //
  //   " ایک مینڈک نے نجومی سے اپنے مستقبل کا پوچھا۔نجومی: تجھے ایک لڑکی ملے گی جو تیرا دل لے جائے گی۔مینڈک خوشی سے: مگر وہ ملے گی کہاں نجومی: بائیولوجی لیباٹری میں",
  //   " ایک چیونٹی ہاتھی پر بیٹھ کر کہیں جارہی تھی، راستے میں کچا پُل آگیا، جسے دیکھ کر چیونٹی بولی، اس پُل کو پار کرلو گے یا میں نیچے اتروں؟",
  //   " ایک پاگل خط لکھ رہا تھا۔ ڈاکٹر: کس کو خط لکھ رہے ہو؟ پاگل: خود کو۔ڈاکٹر: کیا لکھا ہے؟ پاگل: مجھے کیا پتا، ابھی ملا تھوڑی ہے",
  //   "آج کا چٹکلہ: کوئی آنکھوں سے بات کر لیتا ہے. کوئی آنکھوں میں ملاقات کرلیتا ہے. بڑا مشکل ہوتا ہے جواب دینا. جب کوئی انگلش میں سوالات کر لیتا ہے",
  //   "آج کا چٹکلہ: زندگی بےحال ہے سُر ہے نہ تال ہے. میسج باکس بھی کنگال ہے. کیا آپ کی ایس ایم ایس فیکٹری میں ہڑتال ہے. یار کچھ تو بھیجو یہ میرے موبائل کی زندگی کا سوال ہے ",
  //   "آج کا چٹکلہ: لمحہ لمحہ وقت گزر جائے گا،چند لمحوں میں امتحان آجائے گا، ابھی بھی وقت ہے دو لائن پڑھ لو، ورنہ پاس کیا منا بھائی کروائے گا؟",
  //   "آج کا چٹکلہ: آنسو تیرے نکلیں تو آنکھیں میری ہوں. دل تیرا دھڑکے تو دھڑکن میری ہو. خدا کرے دوستی ہماری اتنی گہری ہو. کہ نوکری تو کرے اور سیلری میری ہو",
  //   "آج کا چٹکلہ: بیوی کو اپنی پلکوں پہ بٹھا لو. دے کر خوشی سارے غم چرا لو. پیار ایسا کرو کہ سب دیکھتے رہ جائیں. پڑوسن بھی کہے،مجھے اپنا بنا لو",
  //   "آج کا چٹکلہ: جو مشکل سے ملے وہ ہے خوشی، جو کسی کسی کو ملے وہ ہے پیار، جو سب کو ملے وہ ہے غم، جو نصیب والوں کو ملے وہ ہیں ہم، ہے نہ بات میں دم۔",
  //   "آج کا چٹکلہ: یہ سن کر دماغ ہی گھوم گیا جناب، جب گرل فرینڈ کی دادی نے مجھ سے پوچھا، تم فیس بک پر فراز؟",
  //   "آج کا چٹکلہ: ساری زندگی کر کے برباد عشق کی لذت چکھ لی، اس نے بھی برقعہ پہن لیا ہم نے بھی داڑھی رکھ لی",
  //   "آج کا چٹکلہ: زندگی میں جب تمھیں کوئی راستہ دکھائی نہ دے، کوئی منزل دکھائی نہ دے، کوئی اپنا دکھائی نہ دے، تو تم میرے پاس آجانا میں تمھیں آنکھوں کے ڈاکٹر کے پاس لے جاؤں گا",
  //   "آج کا چٹکلہ: اے دوست تمھاری دوستی پر شک ہے، تم دوسروں کو تو ایس ایم ایس کرتے ہو، تمھاری ان بکس پر ہمارا بھی کچھ حق ہے",
  //   "لطیفہ: سہانا موسم تھا، پركیف ہوائیں چل رہی تھیں ـ حسین و جمیل بیوی نے شوہر كو پرس سے ٹكٹ نكال كر دكھاتے ہوئے كہا، ہم فلم پر جا رہے تھےـ شوہر: اچھاـــــاچھاـــــ بہت اچھا كیا ـ ایڈوانس بكنگ كرالی ـ بیوی نے ٹكٹ واپس پرس میں ركھتےہوئے كہا، میں نیلی كےساتھ فلم دیكھنے جا رہی ہوں تم ذرا پپو كا خیال ركھنا ـ",
  //   "لطیفہ: چار روز كی بےہوشی كے بعد مریض كی آنكھ كھلی تو اپنی چہیتی بیوی كو سرہانے بیٹھے دیكھ كر كہا، خدا كے لیے گھر جا كر آرام كرو بیگم ، میرے ساتھ تم كیوں پریشان ہو رہی ہو؟ مجھےمعلوم تھا آپ یہی كہیں گے اس لیے میں چار روز كےلیے میكے چلی گئی تھی، وہیں سے آرہی ہوں ـ بیوی نے جواب دیا ـ",
  //   "لطیفہ: ایك صاحب كو ڈاك كے ذریعے ایك خط موصول ہوا،جس میں تحریرتھا: اگر تم نے پچاس ہزار روپے تین دن كے اندر اندر فلاں جگہ نہیں پہنچائے تو تمہاری بیوی كو اغوا كرلیں گے ـ اس شخص نے فوراً ہی جواب بھیجا ـ مجھے افسوس ہے كہ میں تمہارا مطالبہ پورا نہیں كرسكوں گا، لیكن مجھے یقین ہے كہ تم اپنا وعدہ ضرور پورا كرو گے ـ",
  //   "لطیفہ: نوجوان جوڑا اپنے ماہانہ بلوں كی ادائیگی كےلیے بے حد پریشان تھاـ شوہر نے بیوی سے كہا، اس ماہ اخراجات بہت زیادہ ہو گئے ہیں ـ سوچ رہاہوں بجلی كا بل ادا كروں یا ڈاكٹر كا؟ ڈارلنگ، تم بجلی كا بل ادا كردو، كیونكہ ڈاكٹر ہمارا دوران خون تو بند كرنےسے رہا ـ بیوی نے جواب دیا ـ",
  //   "لطیفہ: ہنی مون ختم ہوچكاتھاـ شوہر نے نئی نویلی دلہن سے كہا، باقی تو سب ٹھیك ہے بس تم میں كچھ چھوٹی چھوٹی خامیاں ہیں ـ جن سے تمہیں آگاہ كردینا مناسب سمجھتا ہوں ـ بیوی: تمہیں بتانےكی ضرورت نہیں، مجھے ان خامیوں كاعلم ہے اورانہی كی وجہ سے تم سے بہتر كسی شخص سے شادی نہ كر سكی -",
  //   "لطیفہ: ڈاكٹر: آپ كی بیوی صرف پانچ گھنٹے كی مہمان ہے ، آئی ایم سوری ـ شوہر: كوئی بات نہیں ڈاكٹرصاحب، جب 30 سال نكل گئے تو یہ پانچ گھنٹے اور سہی ـ",
  //   "لطیفہ: ایك صاحب نے رومانس پرگفتگو كرتےہوئے اپنے دوست كوبتایا، میری شادی كو پندرہ برس ہوچكےہیں، مگر میری محبت اور گرمجوشی میں ذرا بھی فرق نہیں آیا ـ دوست نے حیران ہوتے ہوئے پوچھا، كیا واقعی؟ ایك سو ایك فیصدـ ان صاحب نے جواب دیاـ یہ اور بات ہے كہ اگر میری بیوی كو میری محبوبہ كے بارے میں پتاچل جائے تو وہ میراخون پی جائے ـ",
  //   "لطيفہ: ایک عورت پر سکته طاری ہوگیا، لوگ اسے مرده سمجھ کر قبرستان لے گئے، رستے میں چارپائی کهمبے سے ٹکرا گئی اور وه عورت اٹھ بیٹھی ـ کچھ عرصه بعد وه عورت سچ مچ مر گئی، جب لوگ اسے دفنانے کے لیے قبرستان جا رہے تهے تو اس کا شوہر بار بار کہہ رہا تها: کهمبے سے بچ کر چلو، کهمبے سے بچ کر چلو ـ",
  //
  // ];
   final joke = [ " کوئی آنکھوں سے بات کر لیتا ہے. کوئی آنکھوں میں ملاقات کرلیتا ہے. بڑا مشکل ہوتا ہے جواب دینا. جب کوئی انگلش میں سوالات کر لیتا ہے"
   " زندگی بےحال ہے سُر ہے نہ تال ہے. میسج باکس بھی کنگال ہے. کیا آپ کی ایس ایم ایس فیکٹری میں ہڑتال ہے. یار کچھ تو بھیجو یہ میرے موبائل کی زندگی کا سوال ہے"
   " پھول ایسا ہو جو گھر کو خوشبو سے بھردے،ہم سفر ایسا ہو جو اندھیروں کو روشن کردے،دوست ایسا ہو جو زندگی کو خوشی اور موبائل کو بیلنس سے بھردے"
   "آج اپنی گرل فرینڈ کی شادی میں آ کے یہ احساس ہوا کہ مٹر پنیر اچھا ہو تو محبت بھی پھیکی لگتی ہے۔ ایک پلیٹ اور دے یار دل ٹوٹا ہے!"
   " آنسو تیرے نکلیں تو آنکھیں میری ہوں. دل تیرا دھڑکے تو دھڑکن میری ہو. خدا کرے دوستی ہماری اتنی گہری ہو. کہ نوکری تو کرے اور سیلری میری ہو"
   " بیوی کو اپنی پلکوں پہ بٹھا لو. دے کر خوشی سارے غم چرا لو. پیار ایسا کرو کہ سب دیکھتے رہ جائیں. پڑوسن بھی کہے،مجھے اپنا بنا لو"
   " جو مشکل سے ملے وہ ہے خوشی، جو کسی کسی کو ملے وہ ہے پیار، جو سب کو ملے وہ ہے غم، جو نصیب والوں کو ملے وہ ہیں ہم، ہے نہ بات میں دم۔"
   " یہ سن کر دماغ ہی گھوم گیا جناب، جب گرل فرینڈ کی دادی نے مجھ سے پوچھا، تم فیس بک پر فراز؟"
   " ساری زندگی کر کے برباد عشق کی لذت چکھ لی، اس نے بھی برقعہ پہن لیا ہم نے بھی داڑھی رکھ لی"
   " اس بے وفا کو نہ آیا ہماری محبت کا یقین، ہم نے کہا ہم مر جائیں اس نے کہا آمین۔ثمہ آمین"
];
   @override
  Widget build(BuildContext context) {
    // return    Card(
    //     elevation: 5,
    //     shape: RoundedRectangleBorder(
    //       borderRadius: BorderRadius.circular(18),
    //     ),
    //     child: Container(
    //       height: 250,
    //       width: double.infinity,
    //       child: Directionality(
    //         textDirection: TextDirection.rtl,
    //         child: Container(
    //           padding: const EdgeInsets.all(16),
    //           child: ListView.builder(
    //             shrinkWrap: true,
    //             itemCount: 1, // Display only one ayat
    //             itemBuilder: (context, index) => ListTile(
    //               title: Container(
    //                 child: Text(
    //                   joke[(currentDay - 1) % joke.length], // Use modulo operator to handle index out of range
    //                   maxLines: 10,
    //                   overflow: TextOverflow.ellipsis,
    //
    //                   style: GoogleFonts.inter(
    //                     fontSize: 25,
    //
    //                     fontWeight: FontWeight.w600,
    //                   ),
    //                 ),
    //               ),
    //             ),
    //           ),
    //         ),
    //       ),
    //     ),
    //   );
return Card(
  elevation: 5,
  shape: RoundedRectangleBorder(
    borderRadius: BorderRadius.circular(18),
  ),
  child: Container(
    height: 250,
    width: double.infinity,
    child: Directionality(
      textDirection: TextDirection.rtl,
      child: Container(
        decoration: BoxDecoration(
          // gradient: LinearGradient(
          //   begin: lang == "ur-PK"
          //       ? Alignment.topLeft
          //       : Alignment.topRight,
          //   end: lang == "ur-PK"
          //       ? Alignment.bottomRight
          //       : Alignment.bottomRight,
          //   colors: const [AppColor.red, AppColor.white],
          // ),
          borderRadius: BorderRadius.circular(18),
          color: AppColor.red,
        ),
        padding: const EdgeInsets.all(16),
        child: ListView.builder(
          shrinkWrap: true,
          itemCount: 1, // Display only one ayat
          itemBuilder: (context, index) {
            final currentDay = DateTime.now().day; // Get the current day
            final jokeIndex = (currentDay - 1) % joke.length; // Calculate the index of the joke based on the current day

            return ListTile(
              title: Container(
                child: Text(
                  joke[jokeIndex], // Use the calculated index to display the joke
                  maxLines: 10,

                  overflow: TextOverflow.ellipsis,
                  style: const TextStyle(color: AppColor.white,fontSize: 25,fontWeight: FontWeight.w600),
                ),
              ),
            );
          },
        ),
      ),
    ),
  ),
);

  }
}
